<a href="https://colab.research.google.com/github/DebasisBehera-164/DMDW-LAB-02/blob/main/ASSIGNMENT2pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [9]:
import pandas as pd

In [10]:
import numpy as np

In [11]:
data=[1,2,3,4,5]
df=pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4
4  5

In [12]:
data=[['Alex' ,10],['jyoti' ,15],['deba',20]]
df=pd.DataFrame(data)
df

       0   1
0   Alex  10
1  jyoti  15
2   deba  20

In [13]:
s = pd.Series([1,3,5, np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [14]:
dates = pd.date_range('20140101' , periods=6)
dates

DatetimeIndex(['2014-01-01', '2014-01-02', '2014-01-03', '2014-01-04',
               '2014-01-05', '2014-01-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df = pd.DataFrame(np.random.randn(6, 4) , index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2014-01-01 -0.634098  0.518049  1.022262  0.496633
2014-01-02  0.177553  0.227182  1.413978 -0.038262
2014-01-03 -0.307435 -1.507809  0.467086  0.260309
2014-01-04  0.812615  1.068411  0.309262 -1.382355
2014-01-05  0.691176 -1.586410 -0.951916 -2.153178
2014-01-06  1.087529 -1.828476  0.005636 -0.501755

In [17]:
df2 = pd.DataFrame({'A': 1., 'B': pd.Timestamp('20140102'), 'C': pd.Series(1, index=list(range(4)), dtype= 'float32'), 'D': np.array([3] * 4 , dtype='int32'), 'E': pd.Categorical(["test" , "train" , "test" ,"train"]), 'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2014-01-02  1.0  3   test  foo
1  1.0 2014-01-02  1.0  3  train  foo
2  1.0 2014-01-02  1.0  3   test  foo
3  1.0 2014-01-02  1.0  3  train  foo

In [18]:
df.head()

                   A         B         C         D
2014-01-01 -0.634098  0.518049  1.022262  0.496633
2014-01-02  0.177553  0.227182  1.413978 -0.038262
2014-01-03 -0.307435 -1.507809  0.467086  0.260309
2014-01-04  0.812615  1.068411  0.309262 -1.382355
2014-01-05  0.691176 -1.586410 -0.951916 -2.153178

In [19]:
df.tail(3)

                   A         B         C         D
2014-01-04  0.812615  1.068411  0.309262 -1.382355
2014-01-05  0.691176 -1.586410 -0.951916 -2.153178
2014-01-06  1.087529 -1.828476  0.005636 -0.501755

In [20]:
df.index

DatetimeIndex(['2014-01-01', '2014-01-02', '2014-01-03', '2014-01-04',
               '2014-01-05', '2014-01-06'],
              dtype='datetime64[ns]', freq='D')

In [21]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [22]:
df.to_numpy()

array([[-0.63409755,  0.51804851,  1.0222624 ,  0.49663266],
       [ 0.17755337,  0.22718194,  1.41397821, -0.03826172],
       [-0.30743513, -1.50780884,  0.46708635,  0.2603094 ],
       [ 0.81261534,  1.06841105,  0.30926163, -1.38235471],
       [ 0.69117639, -1.5864102 , -0.951916  , -2.15317784],
       [ 1.087529  , -1.82847641,  0.00563595, -0.50175485]])

In [23]:
df2.to_numpy()

array([[1.0, Timestamp('2014-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2014-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2014-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2014-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [24]:
df2.describe()

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

In [25]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.304557 -0.518176  0.377718 -0.553101
std    0.677109  1.263643  0.825629  1.027539
min   -0.634098 -1.828476 -0.951916 -2.153178
25%   -0.186188 -1.566760  0.081542 -1.162205
50%    0.434365 -0.640313  0.388174 -0.270008
75%    0.782256  0.445332  0.883468  0.185667
max    1.087529  1.068411  1.413978  0.496633

In [26]:
df.T

   2014-01-01  2014-01-02  2014-01-03  2014-01-04  2014-01-05  2014-01-06
A   -0.634098    0.177553   -0.307435    0.812615    0.691176    1.087529
B    0.518049    0.227182   -1.507809    1.068411   -1.586410   -1.828476
C    1.022262    1.413978    0.467086    0.309262   -0.951916    0.005636
D    0.496633   -0.038262    0.260309   -1.382355   -2.153178   -0.501755